#+setupfile: info/index-bigblow-header.setup
#+include: info/common-header.org
#+AUTHOR: 鈴木正幸，非常勤講師
#+title: 
#+OPTIONS: 
#+property: header-args:R :session *rfors* :results output :exports both :width 400 :height 300

* Rによるやさしい統計学

  #+begin_src shell :exports none
    rm -f RforS-Codes/04-*.R
  #+end_src

  #+RESULTS:

** sample

#+begin_src R :session *t* :results output
size <- 1000
sample <- sample(0:1, size, replace=TRUE, prob=c(0.3, 0.7))
c(mean(sample), var(sample))
#+end_src

#+RESULTS:
: [1] 0.7130000 0.2048358


#+begin_src R :session *t* :results output
sample <- sample(0:1, size, replace=TRUE, prob=c(0.3, 0.7))
c(mean(sample), var(sample))
#+end_src



